Revit 2024 API
BuiltInFailures.DesignOptionFailures.KingNeverInOptionWarn Property
 A selected "[Serf]" belongs to a "[King]" which cannot be added to an Option--it was not added to the Option Set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId KingNeverInOptionWarn { get; }
Visual Basic
Public Shared ReadOnly Property KingNeverInOptionWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ KingNeverInOptionWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace